app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE (lower(user) LIKE '%iv%')
---
  def search
    if params[:title].nil? or params[:title].empty?
      paramnote = params[:note]
      @notes = Note.search(paramnote[:title])

SELECT "notes".* FROM "notes"
---
  def index
    @notes = Note.paginate(:page => params[:page], :per_page => 3)

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @note = Note.find(params[:id])

INSERT INTO "notes" ("content", "created_at", "updated_at", "user") VALUES (?, ?, ?, ?)  [["content", "test"], ["created_at", Tue, 09 Oct 2012 15:58:25 UTC +00:00], ["updated_at", Tue, 09 Oct 2012 15:58:25 UTC +00:00], ["user", "olivier"]]
---
  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save